In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('nba.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 457 entries, 0 to 456
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      456 non-null    object
 1   Team      456 non-null    object
 2   Number    456 non-null    float64
 3   Position  456 non-null    object
 4   Age       456 non-null    float64
 5   Height    456 non-null    object
 6   Weight    456 non-null    float64
 7   College   372 non-null    object
 8   Salary    445 non-null    float64
 9   Bonus     0 non-null      float64
 10  Sales     0 non-null      float64
dtypes: float64(6), object(5)
memory usage: 39.4+ KB

In [4]:
df.isnull().sum()

Name          1
Team          1
Number        1
Position      1
Age           1
Height        1
Weight        1
College      85
Salary       12
Bonus       457
Sales       457
dtype: int64

# DROPNA

In [5]:
df.dropna()

Empty DataFrame
Columns: [Name, Team, Number, Position, Age, Height, Weight, College, Salary, Bonus, Sales]
Index: []

In [6]:
df.shape

(457, 11)

In [7]:
df=pd.read_csv('nba.csv')

In [8]:
df.isnull().sum()

Name          1
Team          1
Number        1
Position      1
Age           1
Height        1
Weight        1
College      85
Salary       12
Bonus       457
Sales       457
dtype: int64

In [9]:
df.shape

(457, 11)

In [10]:
df.head(5)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Bonus,Sales
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,06-Feb,180.0,Texas,7730337.0,NaN,NaN
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,06-Jun,235.0,Marquette,6796117.0,NaN,NaN
2,John Holland,Boston Celtics,30.0,SG,27.0,06-May,205.0,Boston University,NaN,NaN,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,06-May,185.0,Georgia State,1148640.0,NaN,NaN
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,06-Oct,231.0,NaN,5000000.0,NaN,NaN

In [11]:
df1 = df.dropna(axis=0)

In [12]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 0 entries
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      0 non-null      object
 1   Team      0 non-null      object
 2   Number    0 non-null      float64
 3   Position  0 non-null      object
 4   Age       0 non-null      float64
 5   Height    0 non-null      object
 6   Weight    0 non-null      float64
 7   College   0 non-null      object
 8   Salary    0 non-null      float64
 9   Bonus     0 non-null      float64
 10  Sales     0 non-null      float64
dtypes: float64(6), object(5)
memory usage: 0.0+ bytes

In [13]:
df1.isnull().sum()

Name        0
Team        0
Number      0
Position    0
Age         0
Height      0
Weight      0
College     0
Salary      0
Bonus       0
Sales       0
dtype: int64

In [14]:
df.shape

(457, 11)

In [15]:
newdf = df.dropna(axis=1)

In [17]:
newdf.shape

(457, 0)

In [18]:
df.tail(20)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Bonus,Sales
437,C.J. McCollum,Portland Trail Blazers,3.0,SG,24.0,06-Apr,200.0,Lehigh,2525160.0,NaN,NaN
438,Luis Montero,Portland Trail Blazers,44.0,SG,23.0,06-Jul,185.0,Westchester CC,525093.0,NaN,NaN
439,Mason Plumlee,Portland Trail Blazers,24.0,C,26.0,06-Nov,235.0,Duke,1415520.0,NaN,NaN
440,Brian Roberts,Portland Trail Blazers,2.0,PG,30.0,06-Jan,173.0,Dayton,2854940.0,NaN,NaN
441,Noah Vonleh,Portland Trail Blazers,21.0,PF,20.0,06-Sep,240.0,Indiana,2637720.0,NaN,NaN
442,Trevor Booker,Utah Jazz,33.0,PF,28.0,06-Aug,228.0,Clemson,4775000.0,NaN,NaN
443,Trey Burke,Utah Jazz,3.0,PG,23.0,06-Jan,191.0,Michigan,2658240.0,NaN,NaN
444,Alec Burks,Utah Jazz,10.0,SG,24.0,06-Jun,214.0,Colorado,9463484.0,NaN,NaN
445,Dante Exum,Utah Jazz,11.0,PG,20.0,06-Jun,190.0,NaN,3777720.0,NaN,NaN
446,Derrick Favors,Utah Jazz,15.0,PF,24.0,06-Oct,265.0,Georgia Tech,12000000.0,NaN,NaN
447,Rudy Gobert,Utah Jazz,27.0,C,23.0,07-Jan,245.0,NaN,1175880.0,NaN,NaN
448,Gordon Hayward,Utah Jazz,20.0,SF,26.0,06-Aug,226.0,Butler,15409570.0,NaN,NaN
449,Rodney Hood,Utah Jazz,5.0,SG,23.0,06-Aug,206.0,Duke,1348440.0,NaN,NaN
450,Joe Ingles,Utah Jazz,2.0,SF,28.0,06-Aug,226.0,NaN,2050000.0,NaN,NaN
451,Chris Johnson,Utah Jazz,23.0,SF,26.0,06-Jun,206.0,Dayton,981348.0,NaN,NaN
452,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,06-Mar,203.0,Butler,2433333.0,NaN,NaN
454,Raul Neto,Utah Jazz,25.0,PG,24.0,06-Jan,179.0,NaN,900000.0,NaN,NaN
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,07-Mar,256.0,NaN,2900000.0,NaN,NaN
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0,NaN,NaN

In [32]:
newdf = df.dropna(axis=0, how='all')

In [33]:
newdf.shape

(456, 11)

# newdf.shape

In [34]:
df.shape

(457, 11)

In [35]:
df.tail(10)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Bonus,Sales
447,Rudy Gobert,Utah Jazz,27.0,C,23.0,07-Jan,245.0,NaN,1175880.0,NaN,NaN
448,Gordon Hayward,Utah Jazz,20.0,SF,26.0,06-Aug,226.0,Butler,15409570.0,NaN,NaN
449,Rodney Hood,Utah Jazz,5.0,SG,23.0,06-Aug,206.0,Duke,1348440.0,NaN,NaN
450,Joe Ingles,Utah Jazz,2.0,SF,28.0,06-Aug,226.0,NaN,2050000.0,NaN,NaN
451,Chris Johnson,Utah Jazz,23.0,SF,26.0,06-Jun,206.0,Dayton,981348.0,NaN,NaN
452,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,06-Mar,203.0,Butler,2433333.0,NaN,NaN
454,Raul Neto,Utah Jazz,25.0,PG,24.0,06-Jan,179.0,NaN,900000.0,NaN,NaN
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,07-Mar,256.0,NaN,2900000.0,NaN,NaN
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0,NaN,NaN

# RANK

In [4]:
df = df.dropna(axis=0,how='all')

NameError: name 'df' is not defined

In [5]:
df.info()

NameError: name 'df' is not defined

In [6]:
df.isnull().sum()

NameError: name 'df' is not defined

In [7]:
df.columns

NameError: name 'df' is not defined

In [8]:
df['Salary'] = df['Salary'].fillna(0).astype(int)

NameError: name 'df' is not defined

In [9]:
df.isnull().sum()

NameError: name 'df' is not defined

In [10]:
df['Salary'].rank()

NameError: name 'df' is not defined

In [13]:
df['Salary'].rank(ascending=False).astype(int)

NameError: name 'df' is not defined